app/controllers/bids_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "bids" ("product_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["product_id", 1], ["created_at", "2015-07-03 01:17:49.682622"], ["updated_at", "2015-07-03 01:17:49.682622"]]
---
  def create
    @product = Product.find(params[:product_id])
    @bid = @product.bids.build(bid_params)
    @bid.save