app/controllers/products_controller.rb

  def index
    if params[:latitude] && params[:longitude]
      @my_pos = User.new(latitude:params[:latitude], longitude: params[:longitude])
      @sellers = @my_pos.nearbys(2)
      sellers_id = @sellers.collect(&:id)
      @products = Product.where("user_id in (?)", sellers_id)
    else
      @products = Product.all
---
SELECT "products".* FROM "products"